Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: | Example App | Language | SDK | Architecture | Confidential Client? | [Localhost development client ID?](https://atproto.com/specs/oauth#localhost-client-development) | | --- | --- | --- | --- | --- | --- | | [cookbook/react-native-oauth](https://github.com/bluesky-social/cookbook/tree/main/react-native-oauth#readme) | TypeScript | @atproto/oauth-client-expo | Mobile App (no backend) | No | No (requires hosted client metadata) | | [cookbook/vanillajs-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme) | JavaScript | @atproto/oauth-client-browser | Web SPA (no backend) | No | Optionally | | [cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme) | Go | indigo | Web BFF | Optionally | Optionally | | [cookbook/go-oauth-cli-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-cli-app#readme) | Go | indigo | Native CLI | No | No (requires hosted client metadata) | | [cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme) | Python | None | Web BFF | Optionally | Optionally |
ja: | サンプルアプリ | 言語 | SDK | アーキテクチャ | 機密クライアントか？ | [ローカルホスト開発クライアントID？](https://atproto.com/specs/oauth#localhost-client-development) | | --- | --- | --- | --- | --- | --- | | [cookbook/react-native-oauth](https://github.com/bluesky-social/cookbook/tree/main/react-native-oauth#readme) | TypeScript | @atproto/oauth-client-expo | モバイルアプリ（バックエンドなし） | いいえ | いいえ（ホストされたクライアントメタデータが必要） | | [cookbook/vanillajs-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme) | JavaScript | @atproto/oauth-client-browser | Web SPA（バックエンドなし） | いいえ | オプション | | [cookbook/go-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme) | Go | indigo | Web BFF | オプション | オプション | | [cookbook/go-oauth-cli-app](https://github.com/bluesky-social/cookbook/tree/main/go-oauth-cli-app#readme) | Go | indigo | ネイティブCLI | いいえ | いいえ（ホストされたクライアントメタデータが必要） | | [cookbook/python-oauth-web-app](https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme) | Python | なし | Web BFF | オプション | オプション |

source: …and a schema like:
ja: また、スキーマは以下のようになります。

source: …would have a URL like:
ja: これは次のようなURLを持ちます。

source: ⚠Invalid Handle
ja: ⚠無効なハンドル
